In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame
from numpy.random import randn

In [5]:
serr = Series([0,1,2],['A','B','C'])

## index é um objeto imutavel:

In [6]:
serr.index[0] = '0'

TypeError: Index does not support mutable operations

## porém... isso funciona:

In [7]:
serr.index = ['0','1','2']

In [8]:
serr

0    0
1    1
2    2
dtype: int64

In [11]:
serr.reindex(['0','1','2','3'])

0    0.0
1    1.0
2    2.0
3    NaN
dtype: float64

In [12]:
serr.reindex(['0','1','2','3','4','5'],fill_value=0)

0    0
1    1
2    2
3    0
4    0
5    0
dtype: int64

In [13]:
ser3 = Series(['USA','CANADA',"SOUTH AFRICA"],index=[0,5,10])

In [15]:
ser3.reindex(range(15),method='ffill')

0              USA
1              USA
2              USA
3              USA
4              USA
5           CANADA
6           CANADA
7           CANADA
8           CANADA
9           CANADA
10    SOUTH AFRICA
11    SOUTH AFRICA
12    SOUTH AFRICA
13    SOUTH AFRICA
14    SOUTH AFRICA
dtype: object

In [18]:
df = DataFrame(randn(25).reshape(5,5),index=['A','B','D','E','F'],columns=['col1','col2','col3','col4','col5'])

In [19]:
df

       col1      col2      col3      col4      col5
A -0.803601 -2.431607  0.799229  0.430778 -0.665667
B  0.065617 -0.835364  0.012503 -1.785471 -1.734690
D  1.307180  0.055178  0.445051 -1.123237  1.048911
E  2.334552  0.236916 -0.334731  2.612866 -1.132593
F -0.485873  0.181741  0.375830 -0.055853  1.522291

In [20]:
df.reindex(['A','B','C','D','E','F'],columns=['col1','col2','col3','col4','col5','col6'])

       col1      col2      col3      col4      col5  col6
A -0.803601 -2.431607  0.799229  0.430778 -0.665667   NaN
B  0.065617 -0.835364  0.012503 -1.785471 -1.734690   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  1.307180  0.055178  0.445051 -1.123237  1.048911   NaN
E  2.334552  0.236916 -0.334731  2.612866 -1.132593   NaN
F -0.485873  0.181741  0.375830 -0.055853  1.522291   NaN

In [23]:
df2 = df.reindex(['A','B','C','D','E','F'],columns=['col1','col2','col3','col4','col5','col6'])

In [26]:
df2.drop('C').drop('col6',axis=1)

       col1      col2      col3      col4      col5
A -0.803601 -2.431607  0.799229  0.430778 -0.665667
B  0.065617 -0.835364  0.012503 -1.785471 -1.734690
D  1.307180  0.055178  0.445051 -1.123237  1.048911
E  2.334552  0.236916 -0.334731  2.612866 -1.132593
F -0.485873  0.181741  0.375830 -0.055853  1.522291

In [29]:
df2[df2['col2'] < 0]

       col1      col2      col3      col4      col5  col6
A -0.803601 -2.431607  0.799229  0.430778 -0.665667   NaN
B  0.065617 -0.835364  0.012503 -1.785471 -1.734690   NaN

In [31]:
ser = Series(randn(25))

In [34]:
ser.rank()

0      4.0
1     22.0
2      8.0
3     14.0
4      2.0
5     19.0
6      6.0
7     13.0
8     24.0
9     11.0
10     7.0
11     3.0
12     1.0
13    21.0
14    12.0
15    23.0
16    20.0
17    10.0
18    18.0
19    25.0
20     9.0
21    16.0
22    15.0
23     5.0
24    17.0
dtype: float64

In [37]:
ser.sort_values().rank()

12     1.0
4      2.0
11     3.0
0      4.0
23     5.0
6      6.0
10     7.0
2      8.0
20     9.0
17    10.0
9     11.0
14    12.0
7     13.0
3     14.0
22    15.0
21    16.0
24    17.0
18    18.0
5     19.0
16    20.0
13    21.0
1     22.0
15    23.0
8     24.0
19    25.0
dtype: float64

In [39]:
df2.fillna(0)

       col1      col2      col3      col4      col5  col6
A -0.803601 -2.431607  0.799229  0.430778 -0.665667   0.0
B  0.065617 -0.835364  0.012503 -1.785471 -1.734690   0.0
C  0.000000  0.000000  0.000000  0.000000  0.000000   0.0
D  1.307180  0.055178  0.445051 -1.123237  1.048911   0.0
E  2.334552  0.236916 -0.334731  2.612866 -1.132593   0.0
F -0.485873  0.181741  0.375830 -0.055853  1.522291   0.0

In [46]:
df2.dropna(how='all')

       col1      col2      col3      col4      col5  col6
A -0.803601 -2.431607  0.799229  0.430778 -0.665667   NaN
B  0.065617 -0.835364  0.012503 -1.785471 -1.734690   NaN
D  1.307180  0.055178  0.445051 -1.123237  1.048911   NaN
E  2.334552  0.236916 -0.334731  2.612866 -1.132593   NaN
F -0.485873  0.181741  0.375830 -0.055853  1.522291   NaN

In [47]:
df2.dropna(how='all',axis=1)

       col1      col2      col3      col4      col5
A -0.803601 -2.431607  0.799229  0.430778 -0.665667
B  0.065617 -0.835364  0.012503 -1.785471 -1.734690
C       NaN       NaN       NaN       NaN       NaN
D  1.307180  0.055178  0.445051 -1.123237  1.048911
E  2.334552  0.236916 -0.334731  2.612866 -1.132593
F -0.485873  0.181741  0.375830 -0.055853  1.522291

In [49]:
df2.describe()

           col1      col2      col3      col4      col5  col6
count  5.000000  5.000000  5.000000  5.000000  5.000000   0.0
mean   0.483575 -0.558627  0.259576  0.015817 -0.192350   NaN
std    1.311086  1.133846  0.433989  1.692932  1.411349   NaN
min   -0.803601 -2.431607 -0.334731 -1.785471 -1.734690   NaN
25%   -0.485873 -0.835364  0.012503 -1.123237 -1.132593   NaN
50%    0.065617  0.055178  0.375830 -0.055853 -0.665667   NaN
75%    1.307180  0.181741  0.445051  0.430778  1.048911   NaN
max    2.334552  0.236916  0.799229  2.612866  1.522291   NaN

## Merge and multi-index dataframes

In [50]:
left = DataFrame({'key1':['a','b','c','d'],'key2':[0,1,2,3],'data_left':np.arange(4)})

In [52]:
right = DataFrame(randn(4),index=[['a','b','c','d'],[0,1,2,3]],columns=['right_data'])

In [53]:
right

     right_data
a 0   -0.786105
b 1    1.068214
c 2    1.652317
d 3   -1.125070

In [54]:
pd.merge(left=left,right=right,how='outer',left_on=['key1','key2'],right_index=True)

  key1  key2  data_left  right_data
0    a     0          0   -0.786105
1    b     1          1    1.068214
2    c     2          2    1.652317
3    d     3          3   -1.125070

In [55]:
ser1 = Series(np.arange(10))

In [58]:
pd.concat([ser1,ser1],keys=['cat1','cat2'])

cat1  0    0
      1    1
      2    2
      3    3
      4    4
      5    5
      6    6
      7    7
      8    8
      9    9
cat2  0    0
      1    1
      2    2
      3    3
      4    4
      5    5
      6    6
      7    7
      8    8
      9    9
dtype: int64

In [59]:
pd.concat([ser1,ser1],keys=['cat1','cat2'],axis=1)

   cat1  cat2
0     0     0
1     1     1
2     2     2
3     3     3
4     4     4
5     5     5
6     6     6
7     7     7
8     8     8
9     9     9

In [60]:
type(pd.concat([ser1,ser1],keys=['cat1','cat2'],axis=1))

pandas.core.frame.DataFrame